blog/research_tech_stack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Research tech stack</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

                        <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css"> 
</head>
<body>
<div id="content">
<div id="outline-container-orge6b6463" class="outline-2">
<h2 id="orge6b6463">Introduction</h2>
<div class="outline-text-2" id="text-orge6b6463">
<p>
A <i>research tech stack</i> as the set of technologies that a researcher uses to do research. In my personal research this includes tools for reading, writing, programming and managing. The list below is an accumulation of tools that I have found to be productive in my research work.
</p>
</div>
</div>

<div id="outline-container-orga047d9b" class="outline-2">
<h2 id="orga047d9b">Research Tech Stack</h2>
<div class="outline-text-2" id="text-orga047d9b">
</div>
<div id="outline-container-orga873648" class="outline-3">
<h3 id="orga873648">Reading</h3>
<div class="outline-text-3" id="text-orga873648">
<dl class="org-dl">
<dt><a href="https://www.zotero.org/">Zotero</a></dt><dd>Open-source bibliography management software. The bread-and-butter of my research stack.</dd>
<dt><a href="https://scholar.google.com/">Google Scholar</a></dt><dd>Besides being a helpful search engine to look for papers, it also provides a way to stay up-to-date with the latest research publications.</dd>
<dt><a href="https://www.citationgecko.com/">Citation Gecko</a></dt><dd>A search tool to find the most relevant papers to my current research.</dd>
</dl>
</div>
</div>

<div id="outline-container-org09904df" class="outline-3">
<h3 id="org09904df">Writing</h3>
<div class="outline-text-3" id="text-org09904df">
<dl class="org-dl">
<dt><a href="https://www.latex-project.org/">LaTeX</a></dt><dd>Markup language to write mathematical (and non-mathematical!) documents.</dd>
<dt><a href="https://overleaf.com">Overleaf</a></dt><dd>An online LaTeX editor for collaborative writing. Useful in collaborative research projects.</dd>
<dt><a href="https://ia.net/writer">iA Writer</a></dt><dd>Markdown text editor for a visually pleasant writing experience.</dd>
<dt><a href="https://orgmode.org/">Org mode</a></dt><dd>Markup language for creating rich plain text notes. More powerful than Markdown.</dd>
<dt><a href="https://www.orgroam.com/">Zettelkasten (org-roam)</a></dt><dd>Personal knowledge management system for note-taking. I use <code>org-roam</code> in Emacs, but <a href="https://obsidian.md/">Obsidian</a> is a good markdown-based alternative.</dd>
</dl>
</div>
</div>

<div id="outline-container-org94cf639" class="outline-3">
<h3 id="org94cf639">Programming</h3>
<div class="outline-text-3" id="text-org94cf639">
<dl class="org-dl">
<dt><a href="https://www.python.org/">Python</a></dt><dd>My first programming language and also the one I'm most fluent in. I use it for rapid prototyping.</dd>
<dt><a href="https://julialang.org/">Julia</a></dt><dd>As easy as Python, but as fast as C++. I use Julia when I need better computational performance.</dd>
<dt><a href="https://git-scm.com/">Git</a></dt><dd>Version control tool to 1) back-up everything I do and 2) to collaborate with others on software. I mainly use <a href="https://github.com/">GitHub</a>.</dd>
<dt><a href="https://www.gnu.org/software/emacs/">Emacs</a></dt><dd>My favorite text-editor. I use the <a href="https://github.com/hlissner/doom-emacs">Doom</a> framework.</dd>
</dl>
</div>
</div>

<div id="outline-container-org32d8c53" class="outline-3">
<h3 id="org32d8c53">Managing</h3>
<div class="outline-text-3" id="text-org32d8c53">
<dl class="org-dl">
<dt><a href="https://todoist.com">Todoist</a></dt><dd>Task management software. I use this on a daily basis for short-term projects and general to-do management.</dd>
<dt><a href="https://airtable.com">Airtable</a></dt><dd>Project management software. I use this mainly to get a bird's eye view on my long-term projects and to make <a href="https://en.wikipedia.org/wiki/Gantt_chart">Gantt charts</a>. Free 2-year pro trial available for students <a href="https://support.airtable.com/hc/en-us/articles/360008649233-Nonprofit-and-educational-plans-FAQs">here</a>.</dd>
<dt><a href="https://slack.com/">Slack</a></dt><dd>Easy-to-use communication platform with support for threads to keep discussion channels free from clutter.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgc13ad80" class="outline-3">
<h3 id="orgc13ad80">Other</h3>
<div class="outline-text-3" id="text-orgc13ad80">
<dl class="org-dl">
<dt><a href="https://www.inoreader.com">Inoreader</a></dt><dd>RSS feed reader to keep track of the latest blog posts.</dd>
<dt><a href="https://twitter.com">Twitter</a></dt><dd>A fun and informal way to stay up to date with academia.</dd>
</dl>
</div>
</div>
</div>
</div>
</body>
</html>
